## Instalación y primeros pasos

In [1]:
!pip3 install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.10/site-packages (2.0.1)

Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/site-packages (from pandas) (2.8.2)

Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in /usr/local/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /usr/local/lib/python3.10/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd
def crearDataFrame():
    data = [
        {"Nombre": "Alice", "Edad": 25, "Ciudad": "Nueva York"},
        {"Nombre": "Charlie", "Edad": 35, "Ciudad": "Chicago"},
        {"Nombre": "Bob", "Edad": 30, "Ciudad": "Los Ángeles"},
    ]

    df = pd.DataFrame(data)
    return df

## Series

In [3]:
data = pd.Series([1,2,3,4,5])
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
data = pd.Series([1,2,3,4,5], index=["A","B","C","D","E"])
data

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [5]:
diccionario = {"A": 1, "B": 2, "C": 3, "D": 4, "E": 5}
data = pd.Series(diccionario)
data

A    1
B    2
C    3
D    4
E    5
dtype: int64

### Atributos de una serie

In [6]:
data.values

array([1, 2, 3, 4, 5])

In [7]:
data.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [8]:
data.dtype

dtype('int64')

In [9]:
data.name = "Mi serie"
data.name

'Mi serie'

In [10]:
data.shape

(5,)

In [11]:
data.size

5

### Acceso a los elementos de una serie

In [12]:
elemento = data["B"]
elemento

2

In [13]:
elemento = data[2]
elemento

3

In [14]:
elementos = data[["A", "E"]]
elementos

A    1
E    5
Name: Mi serie, dtype: int64

### Métodos de una serie

In [15]:
data.count()

5

In [16]:
data.head(2)

A    1
B    2
Name: Mi serie, dtype: int64

In [17]:
data.tail(2)

D    4
E    5
Name: Mi serie, dtype: int64

In [18]:
data.describe()

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
Name: Mi serie, dtype: float64

In [19]:
data.mean()

3.0

In [20]:
data.sum()

15

In [21]:
data.min()

1

In [22]:
data.max()

5

In [23]:
data.unique()

array([1, 2, 3, 4, 5])

In [24]:
data.nunique()

5

In [25]:
data.value_counts()

Mi serie
1    1
2    1
3    1
4    1
5    1
Name: count, dtype: int64

In [26]:
data.sort_values()

A    1
B    2
C    3
D    4
E    5
Name: Mi serie, dtype: int64

In [27]:
data.idxmax()

'E'

In [28]:
data.idxmin()

'A'

In [29]:
data.isnull()

A    False
B    False
C    False
D    False
E    False
Name: Mi serie, dtype: bool

In [30]:
data.notnull()

A    True
B    True
C    True
D    True
E    True
Name: Mi serie, dtype: bool

In [31]:
data = [1,2,3]
data = pd.Series(data)
data * 5

0     5
1    10
2    15
dtype: int64

## DataFrames

In [32]:
data = [
    {"Nombre": "Alice", "Edad": 25, "Ciudad": "Nueva York"},
    {"Nombre": "Charlie", "Edad": 35, "Ciudad": "Chicago"},
    {"Nombre": "Bob", "Edad": 30, "Ciudad": "Los Ángeles"},
]

df = pd.DataFrame(data)
df

    Nombre  Edad       Ciudad
0    Alice    25   Nueva York
1  Charlie    35      Chicago
2      Bob    30  Los Ángeles

In [33]:
data = [
    ["Alice", 25, "Nueva York"],
    ["Charlie", 35, "Chicago"],
    ["Bob", 30, "Los Ángeles"],
]

df = pd.DataFrame(data)
df

         0   1            2
0    Alice  25   Nueva York
1  Charlie  35      Chicago
2      Bob  30  Los Ángeles

In [34]:
#df = pd.read_csv("archivo.csv")

In [35]:
df = pd.DataFrame()
df["Nombre"] = ["Alice", "Charlie", "Bob"]
df["Edad"] = [25, 30, 35]
df["Ciudad"] = ["Nueva York", "Los Ángeles", "Chicago"]
df

    Nombre  Edad       Ciudad
0    Alice    25   Nueva York
1  Charlie    30  Los Ángeles
2      Bob    35      Chicago

In [36]:
#df.to_csv("mi_archivo.csv", index=False)
#df.to_csv("mi_archivo.xlsx", index=False)
#df.to_csv("mi_archivo.json", orient="records")

In [37]:
#from sqlalchemy import create_engine
#engine = create_engine("sqlite:///mi_base_de_datos.db")
#df.to_sql("mi_tabla", con=engine, if_exists="replace", index=False)

### Atributos de un DataFrame

In [38]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [39]:
df.columns

Index(['Nombre', 'Edad', 'Ciudad'], dtype='object')

In [40]:
df.shape

(3, 3)

In [41]:
df.dtypes

Nombre    object
Edad       int64
Ciudad    object
dtype: object

In [42]:
df.size

9

In [43]:
df.T

                 0            1        2
Nombre       Alice      Charlie      Bob
Edad            25           30       35
Ciudad  Nueva York  Los Ángeles  Chicago

### Métodos de un DataFrame

In [44]:
df.head()

    Nombre  Edad       Ciudad
0    Alice    25   Nueva York
1  Charlie    30  Los Ángeles
2      Bob    35      Chicago

In [45]:
df.tail()

    Nombre  Edad       Ciudad
0    Alice    25   Nueva York
1  Charlie    30  Los Ángeles
2      Bob    35      Chicago

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nombre  3 non-null      object
 1   Edad    3 non-null      int64
 2   Ciudad  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [47]:
df.describe()

       Edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [48]:
df.sort_values(by=["Ciudad"])

    Nombre  Edad       Ciudad
2      Bob    35      Chicago
1  Charlie    30  Los Ángeles
0    Alice    25   Nueva York

In [49]:
df.groupby(by=["Edad"]).max()

       Nombre       Ciudad
Edad
25      Alice   Nueva York
30    Charlie  Los Ángeles
35        Bob      Chicago

In [50]:
tabla = df.merge(df, how='inner', on='Nombre')
tabla

    Nombre  Edad_x     Ciudad_x  Edad_y     Ciudad_y
0    Alice      25   Nueva York      25   Nueva York
1  Charlie      30  Los Ángeles      30  Los Ángeles
2      Bob      35      Chicago      35      Chicago

#### Es de visita obligatoria la información de pandas acerca de como juntar dataframes

https://pandas.pydata.org/docs/user_guide/merging.html

### Acceso a los elementos de un DataFrame

In [51]:
df.iloc[1,2]

'Los Ángeles'

In [52]:
df.iloc[1,:2]

Nombre    Charlie
Edad           30
Name: 1, dtype: object

In [53]:
df.iloc[1]

Nombre        Charlie
Edad               30
Ciudad    Los Ángeles
Name: 1, dtype: object

In [54]:
df["Nombre"]

0      Alice
1    Charlie
2        Bob
Name: Nombre, dtype: object

In [55]:
df.Nombre

0      Alice
1    Charlie
2        Bob
Name: Nombre, dtype: object

In [56]:
df[["Nombre", "Edad"]]

    Nombre  Edad
0    Alice    25
1  Charlie    30
2      Bob    35

### Renombrar elementos de un DataFrame

In [57]:
df = crearDataFrame()
df

    Nombre  Edad       Ciudad
0    Alice    25   Nueva York
1  Charlie    35      Chicago
2      Bob    30  Los Ángeles

In [58]:
df = df.rename(columns = {"Nombre": "Nombre corto", "Edad": "Age"})
df

  Nombre corto  Age       Ciudad
0        Alice   25   Nueva York
1      Charlie   35      Chicago
2          Bob   30  Los Ángeles

In [59]:
df = df.rename(index={1: 1000, 2:2000})
df

     Nombre corto  Age       Ciudad
0           Alice   25   Nueva York
1000      Charlie   35      Chicago
2000          Bob   30  Los Ángeles

### Reindexar un DataFrame

In [60]:
df = df.reindex(index=[0,1000, 3000, 2000], columns=["Nombre corto", "Age", "Ciudad"], fill_value=0)
df

     Nombre corto  Age       Ciudad
0           Alice   25   Nueva York
1000      Charlie   35      Chicago
3000            0    0            0
2000          Bob   30  Los Ángeles

### Trabajar con columnas de un DataFrame

In [61]:
df = crearDataFrame()
df

    Nombre  Edad       Ciudad
0    Alice    25   Nueva York
1  Charlie    35      Chicago
2      Bob    30  Los Ángeles

#### Añadir columnas

In [62]:
#df["Sueldo"] = [1000, 2000], fallaría, la lista debe tener el mismo número de elementos.
df["Sueldo"] = [1000, 2000, 3000]
df

    Nombre  Edad       Ciudad  Sueldo
0    Alice    25   Nueva York    1000
1  Charlie    35      Chicago    2000
2      Bob    30  Los Ángeles    3000

In [63]:
df["Hijos"] = pd.Series([1,0])
df

    Nombre  Edad       Ciudad  Sueldo  Hijos
0    Alice    25   Nueva York    1000    1.0
1  Charlie    35      Chicago    2000    0.0
2      Bob    30  Los Ángeles    3000    NaN

#### Operaciones sobre columnas

In [64]:
df["Edad"] = df["Edad"] + 1
df

    Nombre  Edad       Ciudad  Sueldo  Hijos
0    Alice    26   Nueva York    1000    1.0
1  Charlie    36      Chicago    2000    0.0
2      Bob    31  Los Ángeles    3000    NaN

In [65]:
df["Tiene hijos"] = df["Hijos"] > 0
df

    Nombre  Edad       Ciudad  Sueldo  Hijos  Tiene hijos
0    Alice    26   Nueva York    1000    1.0         True
1  Charlie    36      Chicago    2000    0.0        False
2      Bob    31  Los Ángeles    3000    NaN        False

In [66]:
def concatenar_datos(nombre, edad):
    return "La persona " + nombre + " tiene " + str(edad) + " años."

df["Concatenacion"] = df.apply(lambda x: concatenar_datos(x['Nombre'], x['Edad']), axis=1)
df

,Nombre,Edad,Ciudad,Sueldo,Hijos,Tiene hijos,Concatenacion
0,Alice,26,Nueva York,1000,1.0,True,La persona Alice tiene 26 años.
1,Charlie,36,Chicago,2000,0.0,False,La persona Charlie tiene 36 años.
2,Bob,31,Los Ángeles,3000,NaN,False,La persona Bob tiene 31 años.

La función apply tiene mucha flexibilidad para otorgar a nuestro DataFrame de nuevas funcionalidades. Aquí hay un buen resumen de todo esto:

https://www.dataquest.io/blog/tutorial-how-to-use-the-apply-method-in-pandas/